# 1. Loading Libraries

In [16]:
import pandas as pd
import os

# 2. DataFrames in Python

In [52]:
df = pd.DataFrame({
    'StudentID' : [264422,264423,264444,264445,264446],
    'FirstName' : ['Steven','Alex','Bill','Mark','Bob'],
    'EnrolYear' : [2010,2010,2011,2011,2013],
    'Math' : [100,90,90,40,60],
    'English' : [60,70,80,80,60]
})
df

   StudentID FirstName  EnrolYear  Math  English
0     264422    Steven       2010   100       60
1     264423      Alex       2010    90       70
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80
4     264446       Bob       2013    60       60

### Practice 1

In [67]:
df2 = pd.DataFrame({
    'Height' : [160, 155, 175, 175],
    'Student' : [264422, 264423, 264444, 264445]
})
df2

   Height  Student
0     160   264422
1     155   264423
2     175   264444
3     175   264445

## 2.1 Column and row selection

In [19]:
df['FirstName']
# alt: df.FirstName

0    Steven
1      Alex
2      Bill
3      Mark
4       Bob
Name: FirstName, dtype: object

In [25]:
df[df['FirstName'] == 'Alex']

   StudentID FirstName  EnrolYear  Math  English
1     264423      Alex       2010    90       70

In [26]:
df['FirstName'] == 'Alex'

0    False
1     True
2    False
3    False
4    False
Name: FirstName, dtype: bool

### Practice 2

In [29]:
df[df['EnrolYear'] == 2011]

   StudentID FirstName  EnrolYear  Math  English
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80

In [35]:
filt = (df.FirstName != 'Bob') & (df.StudentID > 264423)
df[filt]

   StudentID FirstName  EnrolYear  Math  English
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80

## 2.2 Modifying the structure of a table

In [53]:
df['Total'] = df['Math'] + df['English']
df

   StudentID FirstName  EnrolYear  Math  English  Total
0     264422    Steven       2010   100       60    160
1     264423      Alex       2010    90       70    160
2     264444      Bill       2011    90       80    170
3     264445      Mark       2011    40       80    120
4     264446       Bob       2013    60       60    120

### Practice 3

In [54]:
df['Average'] = df['Total'] / 2
# alt: df['Average'] = (df['English'] + df['Math']) / 2
df

   StudentID FirstName  EnrolYear  Math  English  Total  Average
0     264422    Steven       2010   100       60    160     80.0
1     264423      Alex       2010    90       70    160     80.0
2     264444      Bill       2011    90       80    170     85.0
3     264445      Mark       2011    40       80    120     60.0
4     264446       Bob       2013    60       60    120     60.0

### Practice 4

In [55]:
filt2 = (df.Total > 150) & ((df.English > 90) | (df.Math > 90))
df[filt2]

   StudentID FirstName  EnrolYear  Math  English  Total  Average
0     264422    Steven       2010   100       60    160     80.0

In [56]:
# turn column names 'Math' and 'English' into values
# for a new column 'Subject'
df = pd.melt(
    df,
    id_vars = ['EnrolYear','FirstName','StudentID'],
    value_vars = ['Math','English'],
    var_name = 'Subject'
)
df

   EnrolYear FirstName  StudentID  Subject  value
0       2010    Steven     264422     Math    100
1       2010      Alex     264423     Math     90
2       2011      Bill     264444     Math     90
3       2011      Mark     264445     Math     40
4       2013       Bob     264446     Math     60
5       2010    Steven     264422  English     60
6       2010      Alex     264423  English     70
7       2011      Bill     264444  English     80
8       2011      Mark     264445  English     80
9       2013       Bob     264446  English     60

In [63]:
# does not change the name of the actual df, only changes in the output
df.rename(columns = {'Score':'Score2'})

   EnrolYear FirstName  StudentID  Subject  Score2
0       2010    Steven     264422     Math     100
1       2010      Alex     264423     Math      90
2       2011      Bill     264444     Math      90
3       2011      Mark     264445     Math      40
4       2013       Bob     264446     Math      60
5       2010    Steven     264422  English      60
6       2010      Alex     264423  English      70
7       2011      Bill     264444  English      80
8       2011      Mark     264445  English      80
9       2013       Bob     264446  English      60

In [65]:
# changes the actual name of the column in df
df.rename(columns = {'value':'Score'}, inplace = True)
df

   EnrolYear FirstName  StudentID  Subject  Score
0       2010    Steven     264422     Math    100
1       2010      Alex     264423     Math     90
2       2011      Bill     264444     Math     90
3       2011      Mark     264445     Math     40
4       2013       Bob     264446     Math     60
5       2010    Steven     264422  English     60
6       2010      Alex     264423  English     70
7       2011      Bill     264444  English     80
8       2011      Mark     264445  English     80
9       2013       Bob     264446  English     60

## 2.3 Merging DataFrames

In [72]:
# matching the column name to enable joining
df2.rename(columns = {'Student':'StudentID'}, inplace = True)

df3 = pd.merge(df, df2, on=['StudentID'])
df3

   EnrolYear FirstName  StudentID  Subject  Score  Height
0       2010    Steven     264422     Math    100     160
1       2010    Steven     264422  English     60     160
2       2010      Alex     264423     Math     90     155
3       2010      Alex     264423  English     70     155
4       2011      Bill     264444     Math     90     175
5       2011      Bill     264444  English     80     175
6       2011      Mark     264445     Math     40     175
7       2011      Mark     264445  English     80     175

### Practice 8

In [74]:
# using left outer join
df3 = pd.merge(df, df2, on=['StudentID'], how = 'left')
df3

   EnrolYear FirstName  StudentID  Subject  Score  Height
0       2010    Steven     264422     Math    100   160.0
1       2010      Alex     264423     Math     90   155.0
2       2011      Bill     264444     Math     90   175.0
3       2011      Mark     264445     Math     40   175.0
4       2013       Bob     264446     Math     60     NaN
5       2010    Steven     264422  English     60   160.0
6       2010      Alex     264423  English     70   155.0
7       2011      Bill     264444  English     80   175.0
8       2011      Mark     264445  English     80   175.0
9       2013       Bob     264446  English     60     NaN

# 3. Reading CSV and Excel files into DataFrames

In [76]:
ufo_reports = pd.read_csv('uforeports.csv')

In [78]:
# displays the first 5 records
ufo_reports.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

### Practice 9

In [79]:
# displays the last 5 records
ufo_reports.tail()

              City Colors Reported Shape Reported State                 Time
18236   Grant Park             NaN       TRIANGLE    IL  2000-12-31 23:00:00
18237  Spirit Lake             NaN           DISK    IA  2000-12-31 23:00:00
18238  Eagle River             NaN            NaN    WI  2000-12-31 23:45:00
18239  Eagle River             RED          LIGHT    WI  2000-12-31 23:45:00
18240         Ybor             NaN           OVAL    FL  2000-12-31 23:59:00

In [83]:
ufo_reports_xls = pd.read_excel(
    'Uforeports_excel.xls',
    sheet_name = 'uforeports'  # need to specify tab name
)
ufo_reports_xls.head()

,City,Colors Reported,Shape Reported,State,Time,Unnamed: 5,Unnamed: 6
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01,10:00:00,PM
1,Willingboro,NaN,OTHER,NJ,1930-06-30,20:00:00,NaN
2,Holyoke,NaN,OVAL,CO,1931-02-15,14:00:00,NaN
3,Abilene,NaN,DISK,KS,1931-06-01,01:00:00,PM
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18,19:00:00,NaN

In [84]:
# when getting data type of Time from csv
print(ufo_reports.Time.dtypes)

object

In [86]:
# when getting data type of Time from xls
print(ufo_reports_xls.Time.dtypes)

datetime64[ns]

In [87]:
# change to datetime format
ufo_reports.Time = pd.to_datetime(ufo_reports.Time)
print(ufo_reports.Time.dtypes)

datetime64[ns]

In [88]:
ufo_reports.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

# 4. Basic Data Auditing

### Practice 10

In [89]:
titanic = pd.read_csv('titanic.csv')
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [90]:
# results are (rows, columns) format
print(titanic.shape)

(891, 15)

In [91]:
titanic.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [92]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [93]:
titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [97]:
# shows top result
titanic.age.value_counts().head()

24.0    30
22.0    27
18.0    26
19.0    25
28.0    25
Name: age, dtype: int64

# 5. Aggregation and Group-By

In [95]:
titanic['age'].mean()

29.69911764705882

In [96]:
titanic['age'].max() # oldest

80.0

In [98]:
titanic['age'].min() # youngest

0.42

In [99]:
titanic['age'].sum() # total years

21205.17

In [100]:
titanic['age'].std() # standard deviation

14.526497332334044

In [101]:
titanic['age'].median() # half of the people were older (/younger)

28.0

In [102]:
titanic['age'].mode() # most common age

0    24.0
Name: age, dtype: float64

In [103]:
sex_class = titanic.groupby(['sex','class'])['age']
sex_class.mean()

sex     class
female  First     34.611765
        Second    28.722973
        Third     21.750000
male    First     41.281386
        Second    30.740707
        Third     26.507589
Name: age, dtype: float64